1. In this lab we will find the customers who were active in consecutive months of May and June. Follow the steps to complete the analysis.

2. Create a table rentals_may to store the data from rental table with information for the month of May.

3. Insert values in the table rentals_may using the table rental, filtering values only for the month of May.

4. Create a table rentals_june to store the data from rental table with information for the month of June.

5. Insert values in the table rentals_june using the table rental, filtering values only for the month of June.

6. Check the number of rentals for each customer for May.

7. Check the number of rentals for each customer for June.

8. Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

9. Check the number of rentals for each customer for May

10. Check the number of rentals for each customer for June

Hint: You can store the results from the two queries in two separate dataframes.

Write a function that checks if customer borrowed more or less books in the month of June as compared to May.

Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [2]:
# getting
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
data_rentals_may = pd.read_sql_query('SELECT * FROM sakila.rentals_may', engine)
data_rentals_june = pd.read_sql_query('SELECT * FROM sakila.rentals_june', engine)

In [3]:
data_rentals_may.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [4]:
data_rentals_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [8]:
# rentals for each customer in may
engine = create_engine(connection_string)
df_customer_rentals_may = pd.read_sql_query('SELECT customer_id, count(rental_id)as rentals FROM sakila.rentals_may group by customer_id order by rentals desc', engine)
df_customer_rentals_may.head()

   customer_id  rentals
0          197        8
1          109        7
2          506        7
3           19        6
4           53        6

In [9]:
# rentals for each customer in june
engine = create_engine(connection_string)
df_customer_rentals_june = pd.read_sql_query('SELECT customer_id, count(rental_id)as rentals FROM sakila.rentals_june group by customer_id order by rentals desc', engine)
df_customer_rentals_june.head()

   customer_id  rentals
0           31       11
1          454       10
2          213        9
3          267        9
4          295        9

In [84]:
df_customer_rentals_june.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 590 entries, 0 to 589
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  590 non-null    int64
 1   rentals      590 non-null    int64
dtypes: int64(2)
memory usage: 9.3 KB

In [116]:
# Write a function that checks 
# if customer borrowed more or less books 
# in the month of June as compared to May.


# merging the data frames
merged = df_customer_rentals_june.merge(df_customer_rentals_may, how='outer', on='customer_id')

In [117]:
# defining a function to check the rentals 

def checkcustomer():
    # preparing lists
    lst_customer_id = list(merged['customer_id'])
    lst_rentals_may = list(merged['rentals_x'])
    lst_rentals_june = list(merged['rentals_y'])
    
    # choose customer to check
    customer = int(input('Which customer would you like to check? '))
    
    if customer in lst_customer_id:
        index = lst_customer_id.index(customer)
        # checking the rentals
        if lst_rentals_may[index] > lst_rentals_june[index]:
            print('Customer {} had more rentals in may.'.format(customer))

        elif lst_rentals_may[index] < lst_rentals_june[index]:
            print('Customer {} had more rentals in June.'.format(customer))

        elif lst_rentals_may[index] == lst_rentals_june[index]:
            print('Customer {} had as many rentals in may as in june.'.format(customer))


        elif lst_rentals_may[index] is False :
            print('Customer {} had no rentals in may.'.format(customer))

        elif lst_rentals_june[index] is False :
            print('Customer {} had no rentals in june.'.format(customer))

        else: print('Unable to compare.')
    
    else: 
        print("Customer doesn't exist.")

In [119]:
# executing the function

checkcustomer()

Which customer would you like to check? 421
Customer 421 had more rentals in may.